Taseenk/stm32f4-ascii-graphics-demo/App/Src/terminal.c
/**
 ******************************************************************************
 * @file           : terminal.c
 * @brief          : ANSI/VT100 Terminal Graphics Driver and Protocol Handler.
 * @details		   : Provides a high-level API for controlling ANSI-compatible
 * terminals (e.g., PuTTY, Tera Term). Core features include:
 * - Cursor and Terminal control using ANSI Escape Sequences.
 * - Primitive drawing (Lines, Rectangles, Triangles, Circles).
 * - Character and String rendering.
 * @note           : All coordinates (col, row) are 1-based to maintain
 * consistency with ANSI/VT100 standards.
 ******************************************************************************
 */

/* Includes ------------------------------------------------------------------*/
// Project libraries
#include "terminal.h"
#include "serial_hw.h"

// STM32 libraries
#include "main.h"
#include "stm32f407xx.h"

// Standard libraries
#include <stdint.h>
#include <stdio.h>
#include <stdlib.h>
#include <string.h>

/* Private Variables ---------------------------------------------------------*/
static uint8_t framebuffer[TERMINAL_BUFFER_SIZE];

/* Private Function Prototypes -----------------------------------------------*/
static void __NormalizeCoordinates(uint16_t *col, uint16_t *row);
static uint8_t __IsValidPos(uint16_t col, uint16_t row);
static void __DrawChar(char c, uint16_t col, uint16_t row);
static void __DrawLineHorizontal(char c, uint16_t x0, uint16_t y0, uint16_t x1, uint16_t y1);
static void __DrawLineVertical(char c, uint16_t x0, uint16_t y0, uint16_t x1, uint16_t y1);

/* Private Functions ---------------------------------------------------------*/
/**
 * @fn static void __NormalizeCoordinates(int16_t *col, int16_t *row)
 * @brief Internal function to ensure that the provided column and row
 * coordinates are at least 1 for ANSI terminal compatibility.
 * @param col Pointer to the column number (1-based index).
 * @param row Pointer to the row number (1-based index).
 */
static void __NormalizeCoordinates(uint16_t *col, uint16_t *row)
{
	// Make row and column always be 1 or greater for ANSI terminals
	if (*row == 0)
		*row = 1;
	if (*col == 0)
		*col = 1;
}

/**
 * @fn static uint8_t __IsValidPos(uint16_t col, uint16_t row)
 * @brief Internal function to check if the provided column and row
 * coordinates are within the valid terminal bounds.
 * @param col The column number (1-based index).
 * @param row The row number (1-based index).
 * @return TRUE if the position is valid, FALSE otherwise.
 */
static uint8_t __IsValidPos(uint16_t col, uint16_t row)
{
	// Check the maximum screen bounds
	if (row < 1 || row > TERMINAL_HEIGHT || col < 1 || col > TERMINAL_WIDTH)
		return FALSE;

	// Return position is valid
	return TRUE;
}

/**
 * @fn static void __DrawChar(char c, uint16_t col, uint16_t row)
 * @brief Internal function for drawing a single character into the
 * terminal framebuffer at the specified row and column. This is a static function and does NOT
 * perform bounds checking. This function updates the internal framebuffer array but does NOT
 * send any data to the terminal.
 * @param c The character to draw.
 * @param col The target column number (1-based index).
 * @param row The target row number (1-based index).
 */
static void __DrawChar(char c, uint16_t col, uint16_t row)
{
	// Check if the starting position is within the screen boundaries
	if (!__IsValidPos(col, row))
		return;

	// Calculate the 1D array index for the 2D framebuffer
	uint32_t index = ((row - 1) * TERMINAL_WIDTH) + (col - 1);

	// Store the character in the framebuffer
	framebuffer[index] = c;
}

/**
 * @fn static void __DrawLineHorizontal(char c, uint16_t x0, uint16_t y0, uint16_t x1, uint16_t y1)
 * @brief Internal function for drawing a horizontal line using Bresenham's algorithm.
 * This function draws a line from (x0, y0) to (x1, y1) in the terminal framebuffer
 * using the specified character. This is a static function and does NOT perform bounds checking.
 * This function updates the internal framebuffer array but does NOT send any data to the terminal.
 * @param c The character to use for drawing the line.
 * @param x0 The starting column (1-based index).
 * @param y0 The starting row (1-based index).
 * @param x1 The ending column (1-based index).
 * @param y1 The ending row (1-based index).
 */
static void __DrawLineHorizontal(char c, uint16_t x0, uint16_t y0, uint16_t x1, uint16_t y1)
{
	// Make sure to draw from left to right
	if (x0 > x1) {
		// Swap x0 and x1
		uint16_t temp_x = x0;
		x0 = x1;
		x1 = temp_x;

		// Swap y0 and y1
		uint16_t temp_y = y0;
		y0 = y1;
		y1 = temp_y;
	}

	// Calculate the horizontal and vertical distances
	int16_t dx = x1 - x0;
	int16_t dy = y1 - y0;

	// Determine the step direction for the y-axis
	int16_t y_direction = (dy < 0) ? -1 : 1;
	if (dy < 0)
		dy = -dy;

	// Initialize Bresenham's decision variables
	int16_t decision_parameter = (2 * dy) - dx;
	int16_t y = y0;

	// Iterate across the x-axis
	for (int16_t x = x0; x <= x1; x++) {
		// Draw the character at (x, y) in the framebuffer
		__DrawChar(c, x, y);

		// Check if decision variable is positive then move to the next y
		if (decision_parameter > 0) {
			y += y_direction;
			// Update error for step in both X and Y
			decision_parameter += (2 * (dy - dx));
		} else {
			// Update error for step in X only
			decision_parameter += (2 * dy);
		}
	}
}

/**
 * @fn static void __DrawLineVertical(char c, uint16_t x0, uint16_t y0, uint16_t x1, uint16_t y1)
 * @brief Internal function for drawing a vertical line using Bresenham's algorithm.
 * This function draws a line from (x0, y0) to (x1, y1) in the terminal framebuffer
 * using the specified character. This is a static function and does NOT perform bounds checking.
 * This function updates the internal framebuffer array but does NOT send any data to the terminal.
 * @param c The character to use for drawing the line.
 * @param x0 The starting column (1-based index).
 * @param y0 The starting row (1-based index).
 * @param x1 The ending column (1-based index).
 * @param y1 The ending row (1-based index).
 */
static void __DrawLineVertical(char c, uint16_t x0, uint16_t y0, uint16_t x1, uint16_t y1)
{
	// Make sure to draw from top to bottom
	if (y0 > y1) {
		// Swap y0 and y1
		uint16_t temp_y = y0;
		y0 = y1;
		y1 = temp_y;

		// Swap x0 and x1
		uint16_t temp_x = x0;
		x0 = x1;
		x1 = temp_x;
	}

