Taseenk/stm32f4-ascii-graphics-demo/App/Src/terminal.c
	// Temporary buffer to hold the ANSI escape sequence (enough for a command like ESC[255;255H) and a string for the whole terminal width
	char buffer[TERMINAL_WIDTH + 16];

	// Format the escape sequence to move the cursor and return the length
	// The length here is without the string terminator (\0)
	int len = snprintf(buffer, sizeof(buffer), ANSI_ESC "%u;%uH%s", (unsigned int)row, (unsigned int)col, str);

	// Check if sprintf failed (len < 0) or if the formatted string exceeded the terminal size
	if (len <= 0 || (size_t)len >= sizeof(buffer))
		return;

	// Transmit the escape sequence via using the precise length calculated by sprintf
	SerialPrintN(buffer, (uint16_t)len);
}

/**
 * @fn void TerminalSetColour(ForegroundColour_t text_colour, BackgroundColour_t background_colour)
 * @brief Sets the terminal text (foreground) and background colours using ANSI escape sequences.
 * This function sends the appropriate ANSI command to change both text and background colours.
 * @param text_colour The desired foreground colour from the ForegroundColour_t enum.
 * @param background_colour The desired background colour from the BackgroundColour_t enum.
 */
void TerminalSetColour(ForegroundColour_t text_colour, BackgroundColour_t background_colour)
{
	// Temporary buffer to hold the ANSI escape sequence
	char buffer[16];

	// Format the escape sequence to move the cursor and return the length
	// The length here is without the string terminator (\0)
	int len = snprintf(buffer, sizeof(buffer), ANSI_ESC "%d;%dm", text_colour, background_colour);

	// Check if sprintf failed (len < 0) or if the formatted string exceeded the buffer size
	if (len <= 0 || (size_t)len >= sizeof(buffer))
		return;

	SerialPrintN(buffer, (uint16_t)len);
}

/**
 * @fn void TerminalSetTextColour(ForegroundColour_t text_colour)
 * @brief Sets the terminal text (foreground) colour using ANSI escape sequences.
 * This function sends the appropriate ANSI command to change only the text colour.
 * @param text_colour The desired foreground colour from the ForegroundColour_t enum.
 */
void TerminalSetTextColour(ForegroundColour_t text_colour)
{
	// Temporary buffer to hold the ANSI escape sequence
	char buffer[16];

	// Length of the formatted string
	int len = 0;

	// Check if the colour is a standard ANSI colour or an extended colour
	// Format the escape sequence to move the cursor and return the length
	// The length here is without the string terminator (\0)
	if (text_colour >= EXTENDED_COLOURS_OFFSET) {
		// Adjust the colour value for extended colours
		text_colour -= EXTENDED_COLOURS_OFFSET;

		// Format based on the extended ANSI forground text colour \x1b[38;5;82m
		len = snprintf(buffer, sizeof(buffer), ANSI_ESC "38;5;%dm", text_colour);
	} else {
		// Format based on the Standard ANSI forground text colour \x1b[32m
		len = snprintf(buffer, sizeof(buffer), ANSI_ESC "%dm", text_colour);
	} 

	// Check if sprintf failed (len < 0) or if the formatted string exceeded the buffer size
	if (len <= 0 || (size_t)len >= sizeof(buffer))
		return;

	// Transmit the escape sequence
	SerialPrintN(buffer, (uint16_t)len);
}

/**
 * @fn void TerminalClearBuffer(void)
 * @brief Clears the internal terminal framebuffer by filling it with space characters.
 * This function does NOT send any data to the terminal; it only updates the internal framebuffer.
 */
void TerminalClearBuffer(void)
{
	// Fill the entire framebuffer with space characters
	memset(framebuffer, SPACE_CHAR, TERMINAL_BUFFER_SIZE);
}

/**
 * @fn void TerminalFlush(void)
 * @brief Sends the entire terminal framebuffer to the terminal display.
 * This function moves the cursor to the home position before transmitting
 * the framebuffer content using DMA for non-blocking transmission.
 */
void TerminalFlush(void)
{
	// Move cursor to home before flushing the framebuffer
	TerminalCursorHome();

	// Send the entire framebuffer to the terminal
	SerialTransmitDMA((const char *)framebuffer, TERMINAL_BUFFER_SIZE);
}

/**
 * @fn void TerminalDrawChar(char c, uint16_t col, uint16_t row)
 * @brief Draws a single character into the terminal framebuffer at the specified row and column.
 * This function updates the internal framebuffer array but does NOT send any data to the terminal.
 * @param c The character to draw.
 * @param col The target column number (1-based index).
 * @param row The target row number (1-based index).
 */
void TerminalDrawChar(char c, uint16_t col, uint16_t row)
{
	// Make row and column always be 1 or greater for ANSI terminals
	__NormalizeCoordinates(&col, &row);

	// Check if the starting position is within the screen boundaries
	if (!__IsValidPos(col, row))
		return;

	// Draw the character in the framebuffer using the internal function
	__DrawChar(c, col, row);
}

/**
 * @fn void TerminalDrawString(const char *str, uint16_t col, uint16_t row)
 * @brief Draws a null-terminated string into the terminal framebuffer at the specified row and column.
 * This function updates the internal framebuffer array but does NOT send any data to the terminal.
 * @param str The string to draw.
 * @param row The target row number (1-based index).
 * @param col The target column number (1-based index).
 */
void TerminalDrawString(const char *str, uint16_t col, uint16_t row)
{
	// Make row and column always be 1 or greater for ANSI terminals
	__NormalizeCoordinates(&col, &row);

	// Check if the starting position is within the screen boundaries
	if (!__IsValidPos(col, row))
		return;

	// Calculate the length of the string
	uint16_t len = (uint16_t)strlen(str);

	// Ensure the string fits within the terminal width
	// Subtract with 1 because the starting 'col' is included in the string length
	if (col + len - 1 > TERMINAL_WIDTH)
		return;

	// Store the string in the framebuffer using the internal function
	for (uint16_t i = 0; i < len; i++) {
		__DrawChar(str[i], col + i, row);
	}
}

/**
 * @fn void TerminalDrawRect(char c, uint16_t col, uint16_t row, uint16_t w, uint16_t h)
 * @brief Draws a rectangle outline into the terminal framebuffer using the specified character.
 * This function updates the internal framebuffer array but does NOT send any data to the terminal.
 * @param c The character to use for drawing the rectangle.
 * @param col The target starting column number (1-based index).
 * @param row The target starting row number (1-based index).
 * @param w The width of the rectangle in characters.
 * @param h The height of the rectangle in characters.
 */
void TerminalDrawRect(char c, uint16_t col, uint16_t row, uint16_t w, uint16_t h)
{
	// Make row and column always be 1 or greater for ANSI terminals
	__NormalizeCoordinates(&col, &row);

	// Quick exit check if the starting position is within the screen boundaries
	// Also check is the rectangle is valid
	if (!__IsValidPos(col, row) || w == 0 || h == 0)
		return;

	// Calculate corner coordinates for x and y
	uint32_t right_col = col + (uint32_t)w - 1;
	uint32_t bottom_row = row + (uint32_t)h - 1;

