Taseenk/stm32f4-ascii-graphics-demo/App/Src/terminal.c
	// Draw Top and Bottom edges
	for (uint16_t i = 0; i < w; i++) {
		__DrawChar(c, col + i, row);
		if (bottom_row <= TERMINAL_HEIGHT)
			__DrawChar(c, col + i, bottom_row);
	}

	// Draw Left and Right edges
	for (uint16_t j = 0; j < h; j++) {
		__DrawChar(c, col, row + j);
		if (right_col <= TERMINAL_WIDTH)
			__DrawChar(c, right_col, row + j);
	}
}

/**
 * @fn void TerminalFillRect(char c, uint16_t col, uint16_t row, uint16_t w, uint16_t h)
 * @brief Fills a rectangle area in the terminal framebuffer using the specified character.
 * This function updates the internal framebuffer array but does NOT send any data to the terminal.
 * @param c The character to use for filling the rectangle.
 * @param col The starting column (1-based index).
 * @param row The starting row (1-based index).
 * @param w The width of the rectangle.
 * @param h The height of the rectangle.
 */
void TerminalFillRect(char c, uint16_t col, uint16_t row, uint16_t w, uint16_t h)
{
	// Make row and column always be 1 or greater for ANSI terminals
	__NormalizeCoordinates(&col, &row);

	// Quick exit check if the starting position is within the screen boundaries
	// Also check is the rectangle is valid
	if (!__IsValidPos(col, row) || w == 0 || h == 0)
		return;

	// Calculate corner coordinates for x and y
	uint32_t right_col = col + (uint32_t)w - 1;
	uint32_t bottom_row = row + (uint32_t)h - 1;

	// Clamp width and height to terminal boundaries
	w = (right_col > TERMINAL_WIDTH) ? (TERMINAL_WIDTH - col + 1) : w;
	h = (bottom_row > TERMINAL_HEIGHT) ? (TERMINAL_HEIGHT - row + 1) : h;

	// Fill the rectangle area in the framebuffer
	for (uint16_t j = 0; j < h; j++) {
		for (uint16_t i = 0; i < w; i++) {
			__DrawChar(c, col + i, row + j);
		}
	}
}

/**
 * @fn void TerminalDrawLine(char c, uint16_t x0, uint16_t y0, uint16_t x1, uint16_t y1)
 * @brief Draws a line between two points in the terminal framebuffer using Bresenham's algorithm.
 * This function determines whether to draw a horizontal or vertical line based on
 * the slope and updates the internal framebuffer array but does NOT send any data to the terminal.
 * @param c The character to use for drawing the line.
 * @param x0 The starting column (1-based index).
 * @param y0 The starting row (1-based index).
 * @param x1 The ending column (1-based index).
 * @param y1 The ending row (1-based index).
 */
void TerminalDrawLine(char c, uint16_t x0, uint16_t y0, uint16_t x1, uint16_t y1)
{
	// Make row and column always be 1 or greater for ANSI terminals
	__NormalizeCoordinates(&x0, &y0);
	__NormalizeCoordinates(&x1, &y1);

	// Check if the line is not off the screen
	if ((x0 > TERMINAL_WIDTH && x1 > TERMINAL_WIDTH) || (y0 > TERMINAL_HEIGHT && y1 > TERMINAL_HEIGHT))
		return;

	// Draw the line using the internal function
	__DrawLine(c, x0, y0, x1, y1);
}

/**
 * @fn void TerminalDrawTriangle(char c, uint16_t x0, uint16_t y0, uint16_t x1, uint16_t y1, uint16_t x2, uint16_t y2)
 * @brief Draws a triangle outline between three points in the terminal framebuffer using Bresenham's algorithm.
 * This function updates the internal framebuffer array but does NOT send any data to the terminal.
 * @param c The character to use for drawing the triangle.
 * @param x0 The column of Vertex A (1-based index).
 * @param y0 The row of Vertex A (1-based index).
 * @param x1 The column of Vertex B (1-based index).
 * @param y1 The row of Vertex B (1-based index).
 * @param x2 The column of Vertex C (1-based index).
 * @param y2 The row of Vertex C (1-based index).
 */
void TerminalDrawTriangle(char c, uint16_t x0, uint16_t y0, uint16_t x1, uint16_t y1, uint16_t x2, uint16_t y2)
{
	// Make row and column always be 1 or greater for ANSI terminals
	__NormalizeCoordinates(&x0, &y0);
	__NormalizeCoordinates(&x1, &y1);
	__NormalizeCoordinates(&x2, &y2);

	// Check if the triangle is not off the screen
	if ((x0 > TERMINAL_WIDTH && x1 > TERMINAL_WIDTH && x2 > TERMINAL_WIDTH) ||
	    (y0 > TERMINAL_HEIGHT && y1 > TERMINAL_HEIGHT && y2 > TERMINAL_HEIGHT))
		return;

	// Draw the line Vertex A to Vertex B
	__DrawLine(c, x0, y0, x1, y1);

	// Draw the line Vertex B to Vertex C
	__DrawLine(c, x1, y1, x2, y2);

	// Draw the line Vertex C back to Vertex A
	__DrawLine(c, x2, y2, x0, y0);
}

/**
 * @fn void TerminalDrawCircle(char c, uint16_t col, uint16_t row, uint16_t r)
 * @brief Draws a line between two points in the terminal framebuffer using Bresenham's algorithm.
 * This function determines whether to draw a horizontal or vertical line based on
 * the slope and updates the internal framebuffer array but does NOT send any data to the terminal.
 * @param c The character to use for drawing the circle.
 * @param col The target center column number (1-based index).
 * @param row The target center row number (1-based index).
 * @param r The radius of the circle in characters.
 */
void TerminalDrawCircle(char c, uint16_t col, uint16_t row, uint16_t r)
{
	// Make row and column always be 1 or greater for ANSI terminals
	__NormalizeCoordinates(&col, &row);

	// Aspect ratio adjustment for terminal character cells that are 2:1
	const uint16_t aspect_ratio = 2;

	// Quick exit check if the circle is valid
	if (r == 0)
		return;

	// Initialize starting point
	int16_t x = 0;
	int16_t y = (int16_t)r;

	// Initial midpoint probability
	int16_t midpoint_probability = 3 - (2 * (int16_t)r);

	while (y >= x) {
		// --- Quadrant 1 (Upper-Right) ---
		__DrawChar(c, (col + (x * aspect_ratio)), (row - y));
		__DrawChar(c, (col + (y * aspect_ratio)), (row - x));

		// --- Quadrant 4 (Lower-Right) ---
		__DrawChar(c, (col + (x * aspect_ratio)), (row + y));
		__DrawChar(c, (col + (y * aspect_ratio)), (row + x));

		// --- Quadrant 3 (Lower-Left) ---
		__DrawChar(c, (col - (x * aspect_ratio)), (row + y));
		__DrawChar(c, (col - (y * aspect_ratio)), (row + x));

		// --- Quadrant 2 (Upper-Left) ---
		__DrawChar(c, (col - (x * aspect_ratio)), (row - y));
		__DrawChar(c, (col - (y * aspect_ratio)), (row - x));

		// Update the decision variable and coordinates
		if (midpoint_probability < 0) {
			midpoint_probability += (4 * x) + 6;
		} else {
			midpoint_probability += (4 * (x - y)) + 10;
			y--;
		}

		// Increment the column
		x++;
	}
}